app/Models/GsbModel.php

SELECT `idutilisateur`, `nom`, `prenom`, `login`, `mdp`, `libelle`, `idRole`
FROM `infos_utilisateur`
WHERE `login` = 'admin'
AND `mdp` = 'admin'
---
    public function get_infos_utilisateur($login, $mdp)
    {
        return $this->db->table('infos_utilisateur')
            ->select('idutilisateur, nom, prenom, login, mdp, libelle, idRole')
            ->where('login', $login)
            ->where('mdp', $mdp)
            ->get()
            ->getRowArray();

SELECT CONCAT(annee, mois) AS "anneemois", `annee`, `mois`
FROM `fichefrais`
WHERE `idVisiteur` = 'a55'
ORDER BY `annee` DESC, `mois` DESC
---
    public function get_les_mois_disponibles($idVisiteur)
    {
        return $this->db->table('fichefrais')
            ->select('CONCAT(annee,mois) AS "anneemois", annee, mois')
            ->where('idVisiteur', $idVisiteur)
            ->orderBy('annee', 'DESC')
            ->orderBy('mois', 'DESC')
            ->get()
            ->getResultArray();

SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`
FROM `fichefrais`
WHERE `fichefrais`.`idVisiteur` = 'b13'
AND `fichefrais`.`annee` IS NULL
AND `fichefrais`.`mois` IS NULL
---
    public function get_id_ficheFrais($idVisiteur, $annee, $mois)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat')
            ->where('fichefrais.idVisiteur', $idVisiteur)
            ->where('fichefrais.annee', $annee)
            ->where('fichefrais.mois', $mois)
            ->get()
            ->getRowArray();

SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`, `fichefrais`.`dateModif`, `fichefrais`.`nbJustificatifs`, `fichefrais`.`montantValide`, `etatfrais`.`libelle`
FROM `fichefrais`
JOIN `etatfrais` ON `fichefrais`.`idEtat` = `etatfrais`.`idetat`
WHERE `fichefrais`.`idFiche` = '45'
---
    public function get_les_infos_ficheFrais($idFiche)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat, fichefrais.dateModif, fichefrais.nbJustificatifs, fichefrais.montantValide, etatfrais.libelle')
            ->join('etatfrais', 'fichefrais.idEtat = etatfrais.idetat')
            ->where('fichefrais.idFiche', $idFiche)
            ->get()
            ->getRowArray();

SELECT `fraisforfait`.`idfraisforfait`, `fraisforfait`.`libelle`, `lignefraisforfait`.`quantite`
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `fraisforfait`.`idfraisforfait` = `lignefraisforfait`.`idFraisForfait`
WHERE `lignefraisforfait`.`idFiche` = '45'
ORDER BY `lignefraisforfait`.`idFraisForfait` ASC
---
    public function get_les_frais_forfait($idFiche)
    {
        return $this->db->table('lignefraisforfait')
            ->select('fraisforfait.idfraisforfait, fraisforfait.libelle, lignefraisforfait.quantite')
            ->join('fraisforfait', 'fraisforfait.idfraisforfait = lignefraisforfait.idFraisForfait')
            ->where('lignefraisforfait.idFiche', $idFiche)
            ->orderBy('lignefraisforfait.idFraisForfait', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '45'
---
    public function get_les_frais_hors_forfait($idFiche)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();

SELECT count(*) AS nblignesfrais
FROM `fichefrais`
WHERE `idVisiteur` = 'a03'
AND `annee` = '2026'
AND `mois` = '03'
---
    public function est_premier_frais_mois($idVisiteur, $annee, $mois)
    {
        $row = $this->db->table('fichefrais')
            ->select('count(*) AS nblignesfrais')
            ->where('idVisiteur', $idVisiteur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->get()
            ->getRowArray();

SELECT `utilisateur`.`idutilisateur`, `utilisateur`.`nom`, `utilisateur`.`prenom`, `fichefrais`.`idFiche`, `fichefrais`.`annee`, `fichefrais`.`mois`, `fichefrais`.`idEtat`
FROM `fichefrais`
JOIN `utilisateur` ON `fichefrais`.`idVisiteur` = `utilisateur`.`idutilisateur`
WHERE `utilisateur`.`idRole` = 'VM'
AND `fichefrais`.`idEtat` = 'VA'
ORDER BY `utilisateur`.`nom` ASC
---
    public function get_visiteurs_fiches_etat($idEtat)
    {
        return $this->db->table('fichefrais')
            ->select('utilisateur.idutilisateur, utilisateur.nom, utilisateur.prenom, fichefrais.idFiche, fichefrais.annee, fichefrais.mois, fichefrais.idEtat')
            ->join('utilisateur', 'fichefrais.idVisiteur = utilisateur.idutilisateur')
            ->where('utilisateur.idRole', 'VM')
            ->where('fichefrais.idEtat', $idEtat)
            ->orderBy('utilisateur.nom', 'ASC')
            ->get()
            ->getResultArray();

UPDATE `utilisateur` SET `mdp` = 'Romy970!!', `dateCreationMdp` = '2026-03-11'
WHERE `idutilisateur` = 'a100'
SELECT `idutilisateur`, `mdp`, `dateCreationMdp`
FROM `utilisateur`
WHERE `idutilisateur` = 'a100'
---
    public function maj_motdepasse($idutilisateur, $nouveauMdp)
    {
        return $this->db->table('utilisateur')
            ->where('idutilisateur', $idutilisateur)
            ->update([
                'mdp' => $nouveauMdp,
                'dateCreationMdp' => date('Y-m-d')
            ]);

SELECT *
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `lignefraisforfait`.`idFraisForfait` = `fraisforfait`.`idfraisforfait`
WHERE `idFiche` = '635'
SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '635'
AND  `libelle` NOT LIKE '%REFUSE%' ESCAPE '!'
---
    public function get_montant_fraisforfait_fraishorsforfait($idFiche)
    {
        $total = 0;

        $lesFraisForfait = $this->db->table('lignefraisforfait')
            ->join('fraisforfait', 'lignefraisforfait.idFraisForfait = fraisforfait.idfraisforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();

        foreach ($lesFraisForfait as $frais) {
            $total += ($frais['quantite'] * $frais['montant']);
        }

        $lesFraisHorsForfait = $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->notLike('libelle', 'REFUSE')
            ->get()
            ->getResultArray();

SELECT *
FROM `lignefraishorsforfait`
WHERE `idLigneFHF` = '2204'
AND  `libelle` NOT LIKE '%REFUSE%' ESCAPE '!'
---
    public function refuser_frais_hors_forfait($idFrais)
    {
        $fraishorsforfait = $this->db->table('lignefraishorsforfait')
            ->where('idLigneFHF', $idFrais)
            ->notLike('libelle', 'REFUSE')
            ->get()
            ->getRowArray();

UPDATE `fichefrais` SET `idEtat` = 'VA', `montantValide` = 225.62
WHERE `idEtat` = 'CL'
AND `idVisiteur` = 'a17'
AND `annee` = '2026'
AND `mois` = '2'
---
    public function maj_etat_fiches_valider($idvisiteur, $annee, $mois)
    {

        $fiche = $this->get_id_ficheFrais($idvisiteur, $annee, $mois);
        $montant = $this->get_montant_fraisforfait_fraishorsforfait($fiche['idFiche']);

        return $this->db->table('fichefrais')
            ->where('idEtat', 'CL')
            ->where('idVisiteur', $idvisiteur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->update([
                'idEtat' => 'VA',
                'montantValide' => $montant
            ]);