app/Models/GsbModel.php

UPDATE `fichefrais` SET `idEtat` = 'RB'
WHERE `idEtat` = 'VA'
AND `idVisiteur` = 'a55'
AND `annee` = '2025'
AND `mois` = '10'
---
    public function maj_etat_fiches_rembourse($idvisiteur, $annee, $mois)
    {
        return $this->db->table('fichefrais')
            ->where('idEtat', 'VA')
            ->where('idVisiteur', $idvisiteur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->update(['idEtat' => 'RB']);